<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>files</key>
	<dict>
		<key>Resources/AppIcon.icns</key>
		<data>
		NvKZmpa7vYK6L5zJ+UD+jNfNEdc=
		</data>
		<key>Resources/Assets.car</key>
		<data>
		FJ/S4QWXeCx1Na6MAw2Fo6FSYtI=
		</data>
		<key>Resources/README.md</key>
		<data>
		HznbLGTQ5gU4kvNGA6bbmoM91CE=
		</data>
		<key>Resources/default.metallib</key>
		<data>
		AdcMtn+THmm6sx3kwT8aswHSgNc=
		</data>
		<key>Resources/yolov8.mlmodelc/analytics/coremldata.bin</key>
		<data>
		7WOMUgL6VlLnIlFJdn6sRwBf6Ns=
		</data>
		<key>Resources/yolov8.mlmodelc/coremldata.bin</key>
		<data>
		ggJYSkxfxnZjzLRGm2JQzuZzCVE=
		</data>
		<key>Resources/yolov8.mlmodelc/model.mil</key>
		<data>
		UCsUAOaeQjUoj7AoHZ37ABZa+Pc=
		</data>
		<key>Resources/yolov8.mlmodelc/weights/weight.bin</key>
		<data>
		2M0u/6YYzJ0VhQbtFbG/rR/kd1Y=
		</data>
		<key>Resources/yolov8s.mlmodelc/analytics/coremldata.bin</key>
		<data>
		XNT/rtf/1C7z+dfLrBZtmFZmxxc=
		</data>
		<key>Resources/yolov8s.mlmodelc/coremldata.bin</key>
		<data>
		0EBVBD6hXtjuw2okSEeyKdXWka8=
		</data>
		<key>Resources/yolov8s.mlmodelc/metadata.json</key>
		<data>
		+xM8GBz5YYq55GReiUx70LtIhdI=
		</data>
		<key>Resources/yolov8s.mlmodelc/model0/analytics/coremldata.bin</key>
		<data>
		KuWHyfuhXWXxQI4kWesF+zL3Pdo=
		</data>
		<key>Resources/yolov8s.mlmodelc/model0/coremldata.bin</key>
		<data>
		UNCfBxsxJw8iu63+7qYlvm6rrgc=
		</data>
		<key>Resources/yolov8s.mlmodelc/model0/model.espresso.net</key>
		<data>
		M+6ZimGe5OWfon4i4ZFY7Y4UEaw=
		</data>
		<key>Resources/yolov8s.mlmodelc/model0/model.espresso.shape</key>
		<data>
		pjR8ADJCSyoEm/Pyy2Asmihl2RM=
		</data>
		<key>Resources/yolov8s.mlmodelc/model0/model.espresso.weights</key>
		<data>
		pSnbpVMFVWcI52oJo/o9pltWIdo=
		</data>
		<key>Resources/yolov8s.mlmodelc/model0/model/coremldata.bin</key>
		<data>
		tGU7K8v0jbmLrWPOZkDsl7EBsZk=
		</data>
		<key>Resources/yolov8s.mlmodelc/model0/neural_network_optionals/coremldata.bin</key>
		<data>
		tkgF5pxT7RlO+9uypQti9obolyA=
		</data>
		<key>Resources/yolov8s.mlmodelc/model1/coremldata.bin</key>
		<data>
		ui2zFs/rcbjANFJ2RivifL+jtkU=
		</data>
	</dict>
	<key>files2</key>
	<dict>
		<key>Resources/AppIcon.icns</key>
		<dict>
			<key>hash2</key>
			<data>
			0BMK5t0rBbhFQXR4P7Eni418HczOsvSVBLA0L0z7rw4=
			</data>
		</dict>
		<key>Resources/Assets.car</key>
		<dict>
			<key>hash2</key>
			<data>
			Ndg3buXfuXqilob/r30PSxEzECFtRSJYXx77iqS3rvc=
			</data>
		</dict>
		<key>Resources/README.md</key>
		<dict>
			<key>hash2</key>
			<data>
			6ZjQzsXD92JsfLoxSwhIRcV4IVvBYHObRe6kt4frX3M=
			</data>
		</dict>
		<key>Resources/default.metallib</key>
		<dict>
			<key>hash2</key>
			<data>
			qMBqOTt6ooxRjmyuDKbRAePLdUgwyuPrcSZPCq/Mh9o=
			</data>
		</dict>
		<key>Resources/yolov8.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			xUwlN/GSATnK5vEg1J3X7pQpYfu0vAKJ5GtW4qi65RE=
			</data>
		</dict>
		<key>Resources/yolov8.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			XCzu9wuRtLHAoxus2qRD/4pYxK23DEzKoOSY/sXKBq8=
			</data>
		</dict>
		<key>Resources/yolov8.mlmodelc/model.mil</key>
		<dict>
			<key>hash2</key>
			<data>
			4Qo6obNvETDnAq8k3aFXhECTMB+U1sUCs6wXVX0IQIo=
			</data>
		</dict>
		<key>Resources/yolov8.mlmodelc/weights/weight.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			ffowAEYg3bkuJmUuJIgOHal+Jv1PayzFZchda2OWsr0=
			</data>
		</dict>
		<key>Resources/yolov8s.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			VVhIJL1LH3mFBhMeNU7iiKlJrenC6xyYuUISDOSYdkQ=
			</data>
		</dict>
		<key>Resources/yolov8s.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			BKzaRao57fTz8tmW9ZpAswOrG9PJ9lznTsoftixWkhs=
			</data>
		</dict>
		<key>Resources/yolov8s.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			OxxM8VGvQ85Uf/KQG4a6z/Yb7jY64FV1SWlW6nryq3E=
			</data>
		</dict>
		<key>Resources/yolov8s.mlmodelc/model0/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			lZI509x9DFJs9rKT4mOGaXn/Xbmtj7jRdN+VL/CQ1G8=
			</data>
		</dict>
		<key>Resources/yolov8s.mlmodelc/model0/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			BtGP2yWbfQtZVPI0NecyCICI5UvVW9v0oSKGKBBwsGc=
			</data>
		</dict>
		<key>Resources/yolov8s.mlmodelc/model0/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			B3PHeV6W+P3WuIKpdLrpJglt+7G3Ca9YY9rclKJ+4G4=
			</data>
		</dict>
		<key>Resources/yolov8s.mlmodelc/model0/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			53ary6NekpdRnXnVLDxbNpmT7XOk+RbJNnquqjMTcuY=
			</data>
		</dict>
		<key>Resources/yolov8s.mlmodelc/model0/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			yO1jcsHUlX4HuAmZPc/5HOamD6pZmrTsy9B0XM9JH/0=
			</data>
		</dict>
		<key>Resources/yolov8s.mlmodelc/model0/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			JsMfzXP3J1PCXEF2nqub8rHW9vXpXkr2ag9c2kxRcE8=
			</data>
		</dict>
		<key>Resources/yolov8s.mlmodelc/model0/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			WTG9U2xFUClKISxvyNPBvuddqBeYC6C2cchgPa+zYjg=
			</data>
		</dict>
		<key>Resources/yolov8s.mlmodelc/model1/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			RxFXKbAMKjV6Q7kqJ5MBzmrQAW68daRdgldwX2bPqRk=
			</data>
		</dict>
	</dict>
	<key>rules</key>
	<dict>
		<key>^Resources/</key>
		<true/>
		<key>^Resources/.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^Resources/.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Resources/Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^version.plist$</key>
		<true/>
	</dict>
	<key>rules2</key>
	<dict>
		<key>.*\.dSYM($|/)</key>
		<dict>
			<key>weight</key>
			<real>11</real>
		</dict>
		<key>^(.*/)?\.DS_Store$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>2000</real>
		</dict>
		<key>^(Frameworks|SharedFrameworks|PlugIns|Plug-ins|XPCServices|Helpers|MacOS|Library/(Automator|Spotlight|LoginItems))/</key>
		<dict>
			<key>nested</key>
			<true/>
			<key>weight</key>
			<real>10</real>
		</dict>
		<key>^.*</key>
		<true/>
		<key>^Info\.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^PkgInfo$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^Resources/</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^Resources/.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^Resources/.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Resources/Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^[^/]+$</key>
		<dict>
			<key>nested</key>
			<true/>
			<key>weight</key>
			<real>10</real>
		</dict>
		<key>^embedded\.provisionprofile$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^version\.plist$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
	</dict>
</dict>
</plist>
