program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3304.6.1"}, {"coremlc-version", "3304.7.1"}, {"coremltools-component-torch", "2.4.0"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "8.0b2"}})]
{
    func main<ios15>(tensor<fp32, [1, 3, 640, 640]> image) {
            tensor<fp32, []> image__scaled___y_0 = const()[name = tensor<string, []>("image__scaled___y_0"), val = tensor<fp32, []>(0x1.010102p-8)];
            tensor<fp32, [1, 3, 640, 640]> image__scaled__ = mul(x = image, y = image__scaled___y_0)[name = tensor<string, []>("image__scaled__")];
            tensor<int32, []> var_20 = const()[name = tensor<string, []>("op_20"), val = tensor<int32, []>(1)];
            tensor<int32, []> var_21 = const()[name = tensor<string, []>("op_21"), val = tensor<int32, []>(2)];
            tensor<int32, [2]> var_59 = const()[name = tensor<string, []>("op_59"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> var_61 = const()[name = tensor<string, []>("op_61"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_1_pad_type_0 = const()[name = tensor<string, []>("input_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_1_pad_0 = const()[name = tensor<string, []>("input_1_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<string, []> image_to_fp16_dtype_0 = const()[name = tensor<string, []>("image_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [32, 3, 3, 3]> model_model_0_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_0_conv_weight_to_fp16"), val = tensor<fp16, [32, 3, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [32]> model_model_0_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_0_conv_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1856)))];
            tensor<fp16, [1, 3, 640, 640]> image_to_fp16 = cast(dtype = image_to_fp16_dtype_0, x = image__scaled__)[name = tensor<string, []>("cast_9")];
            tensor<fp16, [1, 32, 320, 320]> input_1_cast_fp16 = conv(bias = model_model_0_conv_bias_to_fp16, dilations = var_61, groups = var_20, pad = input_1_pad_0, pad_type = input_1_pad_type_0, strides = var_59, weight = model_model_0_conv_weight_to_fp16, x = image_to_fp16)[name = tensor<string, []>("input_1_cast_fp16")];
            tensor<fp16, [1, 32, 320, 320]> input_3_cast_fp16 = silu(x = input_1_cast_fp16)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<int32, [2]> var_68 = const()[name = tensor<string, []>("op_68"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> var_70 = const()[name = tensor<string, []>("op_70"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_5_pad_type_0 = const()[name = tensor<string, []>("input_5_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_5_pad_0 = const()[name = tensor<string, []>("input_5_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [64, 32, 3, 3]> model_model_1_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_1_conv_weight_to_fp16"), val = tensor<fp16, [64, 32, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1984)))];
            tensor<fp16, [64]> model_model_1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_1_conv_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(38912)))];
            tensor<fp16, [1, 64, 160, 160]> input_5_cast_fp16 = conv(bias = model_model_1_conv_bias_to_fp16, dilations = var_70, groups = var_20, pad = input_5_pad_0, pad_type = input_5_pad_type_0, strides = var_68, weight = model_model_1_conv_weight_to_fp16, x = input_3_cast_fp16)[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<fp16, [1, 64, 160, 160]> input_7_cast_fp16 = silu(x = input_5_cast_fp16)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<int32, [2]> var_81 = const()[name = tensor<string, []>("op_81"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_83 = const()[name = tensor<string, []>("op_83"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_9_pad_type_0 = const()[name = tensor<string, []>("input_9_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_9_pad_0 = const()[name = tensor<string, []>("input_9_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [64, 64, 1, 1]> model_model_2_cv1_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_2_cv1_conv_weight_to_fp16"), val = tensor<fp16, [64, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(39104)))];
            tensor<fp16, [64]> model_model_2_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_2_cv1_conv_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(47360)))];
            tensor<fp16, [1, 64, 160, 160]> input_9_cast_fp16 = conv(bias = model_model_2_cv1_conv_bias_to_fp16, dilations = var_83, groups = var_20, pad = input_9_pad_0, pad_type = input_9_pad_type_0, strides = var_81, weight = model_model_2_cv1_conv_weight_to_fp16, x = input_7_cast_fp16)[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<fp16, [1, 64, 160, 160]> var_86_cast_fp16 = silu(x = input_9_cast_fp16)[name = tensor<string, []>("op_86_cast_fp16")];
            tensor<int32, [2]> var_87 = const()[name = tensor<string, []>("op_87"), val = tensor<int32, [2]>([32, 32])];
            tensor<int32, []> var_88_axis_0 = const()[name = tensor<string, []>("op_88_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 32, 160, 160]> var_88_cast_fp16_0, tensor<fp16, [1, 32, 160, 160]> var_88_cast_fp16_1 = split(axis = var_88_axis_0, split_sizes = var_87, x = var_86_cast_fp16)[name = tensor<string, []>("op_88_cast_fp16")];
            tensor<int32, [2]> var_96 = const()[name = tensor<string, []>("op_96"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_98 = const()[name = tensor<string, []>("op_98"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_13_pad_type_0 = const()[name = tensor<string, []>("input_13_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_13_pad_0 = const()[name = tensor<string, []>("input_13_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [32, 32, 3, 3]> model_model_2_m_0_cv1_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_2_m_0_cv1_conv_weight_to_fp16"), val = tensor<fp16, [32, 32, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(47552)))];
            tensor<fp16, [32]> model_model_2_m_0_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_2_m_0_cv1_conv_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(66048)))];
            tensor<fp16, [1, 32, 160, 160]> input_13_cast_fp16 = conv(bias = model_model_2_m_0_cv1_conv_bias_to_fp16, dilations = var_98, groups = var_20, pad = input_13_pad_0, pad_type = input_13_pad_type_0, strides = var_96, weight = model_model_2_m_0_cv1_conv_weight_to_fp16, x = var_88_cast_fp16_1)[name = tensor<string, []>("input_13_cast_fp16")];
            tensor<fp16, [1, 32, 160, 160]> input_15_cast_fp16 = silu(x = input_13_cast_fp16)[name = tensor<string, []>("input_15_cast_fp16")];
            tensor<int32, [2]> var_105 = const()[name = tensor<string, []>("op_105"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_107 = const()[name = tensor<string, []>("op_107"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_17_pad_type_0 = const()[name = tensor<string, []>("input_17_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_17_pad_0 = const()[name = tensor<string, []>("input_17_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [32, 32, 3, 3]> model_model_2_m_0_cv2_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_2_m_0_cv2_conv_weight_to_fp16"), val = tensor<fp16, [32, 32, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(66176)))];
            tensor<fp16, [32]> model_model_2_m_0_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_2_m_0_cv2_conv_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(84672)))];
            tensor<fp16, [1, 32, 160, 160]> input_17_cast_fp16 = conv(bias = model_model_2_m_0_cv2_conv_bias_to_fp16, dilations = var_107, groups = var_20, pad = input_17_pad_0, pad_type = input_17_pad_type_0, strides = var_105, weight = model_model_2_m_0_cv2_conv_weight_to_fp16, x = input_15_cast_fp16)[name = tensor<string, []>("input_17_cast_fp16")];
            tensor<fp16, [1, 32, 160, 160]> var_110_cast_fp16 = silu(x = input_17_cast_fp16)[name = tensor<string, []>("op_110_cast_fp16")];
            tensor<fp16, [1, 32, 160, 160]> var_111_cast_fp16 = add(x = var_88_cast_fp16_1, y = var_110_cast_fp16)[name = tensor<string, []>("op_111_cast_fp16")];
            tensor<bool, []> input_19_interleave_0 = const()[name = tensor<string, []>("input_19_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 96, 160, 160]> input_19_cast_fp16 = concat(axis = var_20, interleave = input_19_interleave_0, values = (var_88_cast_fp16_0, var_88_cast_fp16_1, var_111_cast_fp16))[name = tensor<string, []>("input_19_cast_fp16")];
            tensor<int32, [2]> var_117 = const()[name = tensor<string, []>("op_117"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_119 = const()[name = tensor<string, []>("op_119"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_21_pad_type_0 = const()[name = tensor<string, []>("input_21_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_21_pad_0 = const()[name = tensor<string, []>("input_21_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [64, 96, 1, 1]> model_model_2_cv2_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_2_cv2_conv_weight_to_fp16"), val = tensor<fp16, [64, 96, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(84800)))];
            tensor<fp16, [64]> model_model_2_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_2_cv2_conv_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(97152)))];
            tensor<fp16, [1, 64, 160, 160]> input_21_cast_fp16 = conv(bias = model_model_2_cv2_conv_bias_to_fp16, dilations = var_119, groups = var_20, pad = input_21_pad_0, pad_type = input_21_pad_type_0, strides = var_117, weight = model_model_2_cv2_conv_weight_to_fp16, x = input_19_cast_fp16)[name = tensor<string, []>("input_21_cast_fp16")];
            tensor<fp16, [1, 64, 160, 160]> input_23_cast_fp16 = silu(x = input_21_cast_fp16)[name = tensor<string, []>("input_23_cast_fp16")];
            tensor<int32, [2]> var_126 = const()[name = tensor<string, []>("op_126"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> var_128 = const()[name = tensor<string, []>("op_128"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_25_pad_type_0 = const()[name = tensor<string, []>("input_25_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_25_pad_0 = const()[name = tensor<string, []>("input_25_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [128, 64, 3, 3]> model_model_3_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_3_conv_weight_to_fp16"), val = tensor<fp16, [128, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(97344)))];
            tensor<fp16, [128]> model_model_3_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_3_conv_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(244864)))];
            tensor<fp16, [1, 128, 80, 80]> input_25_cast_fp16 = conv(bias = model_model_3_conv_bias_to_fp16, dilations = var_128, groups = var_20, pad = input_25_pad_0, pad_type = input_25_pad_type_0, strides = var_126, weight = model_model_3_conv_weight_to_fp16, x = input_23_cast_fp16)[name = tensor<string, []>("input_25_cast_fp16")];
            tensor<fp16, [1, 128, 80, 80]> input_27_cast_fp16 = silu(x = input_25_cast_fp16)[name = tensor<string, []>("input_27_cast_fp16")];
            tensor<int32, [2]> var_141 = const()[name = tensor<string, []>("op_141"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_143 = const()[name = tensor<string, []>("op_143"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_29_pad_type_0 = const()[name = tensor<string, []>("input_29_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_29_pad_0 = const()[name = tensor<string, []>("input_29_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [128, 128, 1, 1]> model_model_4_cv1_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_4_cv1_conv_weight_to_fp16"), val = tensor<fp16, [128, 128, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(245184)))];
            tensor<fp16, [128]> model_model_4_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_4_cv1_conv_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(278016)))];
            tensor<fp16, [1, 128, 80, 80]> input_29_cast_fp16 = conv(bias = model_model_4_cv1_conv_bias_to_fp16, dilations = var_143, groups = var_20, pad = input_29_pad_0, pad_type = input_29_pad_type_0, strides = var_141, weight = model_model_4_cv1_conv_weight_to_fp16, x = input_27_cast_fp16)[name = tensor<string, []>("input_29_cast_fp16")];
            tensor<fp16, [1, 128, 80, 80]> var_146_cast_fp16 = silu(x = input_29_cast_fp16)[name = tensor<string, []>("op_146_cast_fp16")];
            tensor<int32, [2]> var_147 = const()[name = tensor<string, []>("op_147"), val = tensor<int32, [2]>([64, 64])];
            tensor<int32, []> var_148_axis_0 = const()[name = tensor<string, []>("op_148_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 64, 80, 80]> var_148_cast_fp16_0, tensor<fp16, [1, 64, 80, 80]> var_148_cast_fp16_1 = split(axis = var_148_axis_0, split_sizes = var_147, x = var_146_cast_fp16)[name = tensor<string, []>("op_148_cast_fp16")];
            tensor<int32, [2]> var_156 = const()[name = tensor<string, []>("op_156"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_158 = const()[name = tensor<string, []>("op_158"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_33_pad_type_0 = const()[name = tensor<string, []>("input_33_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_33_pad_0 = const()[name = tensor<string, []>("input_33_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [64, 64, 3, 3]> model_model_4_m_0_cv1_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_4_m_0_cv1_conv_weight_to_fp16"), val = tensor<fp16, [64, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(278336)))];
            tensor<fp16, [64]> model_model_4_m_0_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_4_m_0_cv1_conv_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(352128)))];
            tensor<fp16, [1, 64, 80, 80]> input_33_cast_fp16 = conv(bias = model_model_4_m_0_cv1_conv_bias_to_fp16, dilations = var_158, groups = var_20, pad = input_33_pad_0, pad_type = input_33_pad_type_0, strides = var_156, weight = model_model_4_m_0_cv1_conv_weight_to_fp16, x = var_148_cast_fp16_1)[name = tensor<string, []>("input_33_cast_fp16")];
            tensor<fp16, [1, 64, 80, 80]> input_35_cast_fp16 = silu(x = input_33_cast_fp16)[name = tensor<string, []>("input_35_cast_fp16")];
            tensor<int32, [2]> var_165 = const()[name = tensor<string, []>("op_165"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_167 = const()[name = tensor<string, []>("op_167"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_37_pad_type_0 = const()[name = tensor<string, []>("input_37_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_37_pad_0 = const()[name = tensor<string, []>("input_37_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [64, 64, 3, 3]> model_model_4_m_0_cv2_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_4_m_0_cv2_conv_weight_to_fp16"), val = tensor<fp16, [64, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(352320)))];
            tensor<fp16, [64]> model_model_4_m_0_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_4_m_0_cv2_conv_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(426112)))];
            tensor<fp16, [1, 64, 80, 80]> input_37_cast_fp16 = conv(bias = model_model_4_m_0_cv2_conv_bias_to_fp16, dilations = var_167, groups = var_20, pad = input_37_pad_0, pad_type = input_37_pad_type_0, strides = var_165, weight = model_model_4_m_0_cv2_conv_weight_to_fp16, x = input_35_cast_fp16)[name = tensor<string, []>("input_37_cast_fp16")];
            tensor<fp16, [1, 64, 80, 80]> var_170_cast_fp16 = silu(x = input_37_cast_fp16)[name = tensor<string, []>("op_170_cast_fp16")];
            tensor<fp16, [1, 64, 80, 80]> input_39_cast_fp16 = add(x = var_148_cast_fp16_1, y = var_170_cast_fp16)[name = tensor<string, []>("input_39_cast_fp16")];
            tensor<int32, [2]> var_177 = const()[name = tensor<string, []>("op_177"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_179 = const()[name = tensor<string, []>("op_179"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_41_pad_type_0 = const()[name = tensor<string, []>("input_41_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_41_pad_0 = const()[name = tensor<string, []>("input_41_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [64, 64, 3, 3]> model_model_4_m_1_cv1_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_4_m_1_cv1_conv_weight_to_fp16"), val = tensor<fp16, [64, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(426304)))];
            tensor<fp16, [64]> model_model_4_m_1_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_4_m_1_cv1_conv_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(500096)))];
            tensor<fp16, [1, 64, 80, 80]> input_41_cast_fp16 = conv(bias = model_model_4_m_1_cv1_conv_bias_to_fp16, dilations = var_179, groups = var_20, pad = input_41_pad_0, pad_type = input_41_pad_type_0, strides = var_177, weight = model_model_4_m_1_cv1_conv_weight_to_fp16, x = input_39_cast_fp16)[name = tensor<string, []>("input_41_cast_fp16")];
            tensor<fp16, [1, 64, 80, 80]> input_43_cast_fp16 = silu(x = input_41_cast_fp16)[name = tensor<string, []>("input_43_cast_fp16")];
            tensor<int32, [2]> var_186 = const()[name = tensor<string, []>("op_186"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_188 = const()[name = tensor<string, []>("op_188"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_45_pad_type_0 = const()[name = tensor<string, []>("input_45_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_45_pad_0 = const()[name = tensor<string, []>("input_45_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [64, 64, 3, 3]> model_model_4_m_1_cv2_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_4_m_1_cv2_conv_weight_to_fp16"), val = tensor<fp16, [64, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(500288)))];
            tensor<fp16, [64]> model_model_4_m_1_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_4_m_1_cv2_conv_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(574080)))];
            tensor<fp16, [1, 64, 80, 80]> input_45_cast_fp16 = conv(bias = model_model_4_m_1_cv2_conv_bias_to_fp16, dilations = var_188, groups = var_20, pad = input_45_pad_0, pad_type = input_45_pad_type_0, strides = var_186, weight = model_model_4_m_1_cv2_conv_weight_to_fp16, x = input_43_cast_fp16)[name = tensor<string, []>("input_45_cast_fp16")];
            tensor<fp16, [1, 64, 80, 80]> var_191_cast_fp16 = silu(x = input_45_cast_fp16)[name = tensor<string, []>("op_191_cast_fp16")];
            tensor<fp16, [1, 64, 80, 80]> var_192_cast_fp16 = add(x = input_39_cast_fp16, y = var_191_cast_fp16)[name = tensor<string, []>("op_192_cast_fp16")];
            tensor<bool, []> input_47_interleave_0 = const()[name = tensor<string, []>("input_47_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 256, 80, 80]> input_47_cast_fp16 = concat(axis = var_20, interleave = input_47_interleave_0, values = (var_148_cast_fp16_0, var_148_cast_fp16_1, input_39_cast_fp16, var_192_cast_fp16))[name = tensor<string, []>("input_47_cast_fp16")];
            tensor<int32, [2]> var_198 = const()[name = tensor<string, []>("op_198"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_200 = const()[name = tensor<string, []>("op_200"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_49_pad_type_0 = const()[name = tensor<string, []>("input_49_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_49_pad_0 = const()[name = tensor<string, []>("input_49_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [128, 256, 1, 1]> model_model_4_cv2_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_4_cv2_conv_weight_to_fp16"), val = tensor<fp16, [128, 256, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(574272)))];
            tensor<fp16, [128]> model_model_4_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_4_cv2_conv_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(639872)))];
            tensor<fp16, [1, 128, 80, 80]> input_49_cast_fp16 = conv(bias = model_model_4_cv2_conv_bias_to_fp16, dilations = var_200, groups = var_20, pad = input_49_pad_0, pad_type = input_49_pad_type_0, strides = var_198, weight = model_model_4_cv2_conv_weight_to_fp16, x = input_47_cast_fp16)[name = tensor<string, []>("input_49_cast_fp16")];
            tensor<fp16, [1, 128, 80, 80]> input_51_cast_fp16 = silu(x = input_49_cast_fp16)[name = tensor<string, []>("input_51_cast_fp16")];
            tensor<int32, [2]> var_207 = const()[name = tensor<string, []>("op_207"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> var_209 = const()[name = tensor<string, []>("op_209"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_53_pad_type_0 = const()[name = tensor<string, []>("input_53_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_53_pad_0 = const()[name = tensor<string, []>("input_53_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [256, 128, 3, 3]> model_model_5_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_5_conv_weight_to_fp16"), val = tensor<fp16, [256, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(640192)))];
            tensor<fp16, [256]> model_model_5_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_5_conv_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1230080)))];
            tensor<fp16, [1, 256, 40, 40]> input_53_cast_fp16 = conv(bias = model_model_5_conv_bias_to_fp16, dilations = var_209, groups = var_20, pad = input_53_pad_0, pad_type = input_53_pad_type_0, strides = var_207, weight = model_model_5_conv_weight_to_fp16, x = input_51_cast_fp16)[name = tensor<string, []>("input_53_cast_fp16")];
            tensor<fp16, [1, 256, 40, 40]> input_55_cast_fp16 = silu(x = input_53_cast_fp16)[name = tensor<string, []>("input_55_cast_fp16")];
            tensor<int32, [2]> var_222 = const()[name = tensor<string, []>("op_222"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_224 = const()[name = tensor<string, []>("op_224"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_57_pad_type_0 = const()[name = tensor<string, []>("input_57_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_57_pad_0 = const()[name = tensor<string, []>("input_57_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [256, 256, 1, 1]> model_model_6_cv1_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_6_cv1_conv_weight_to_fp16"), val = tensor<fp16, [256, 256, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1230656)))];
            tensor<fp16, [256]> model_model_6_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_6_cv1_conv_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1361792)))];
            tensor<fp16, [1, 256, 40, 40]> input_57_cast_fp16 = conv(bias = model_model_6_cv1_conv_bias_to_fp16, dilations = var_224, groups = var_20, pad = input_57_pad_0, pad_type = input_57_pad_type_0, strides = var_222, weight = model_model_6_cv1_conv_weight_to_fp16, x = input_55_cast_fp16)[name = tensor<string, []>("input_57_cast_fp16")];
            tensor<fp16, [1, 256, 40, 40]> var_227_cast_fp16 = silu(x = input_57_cast_fp16)[name = tensor<string, []>("op_227_cast_fp16")];
            tensor<int32, [2]> var_228 = const()[name = tensor<string, []>("op_228"), val = tensor<int32, [2]>([128, 128])];
            tensor<int32, []> var_229_axis_0 = const()[name = tensor<string, []>("op_229_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 128, 40, 40]> var_229_cast_fp16_0, tensor<fp16, [1, 128, 40, 40]> var_229_cast_fp16_1 = split(axis = var_229_axis_0, split_sizes = var_228, x = var_227_cast_fp16)[name = tensor<string, []>("op_229_cast_fp16")];
            tensor<int32, [2]> var_237 = const()[name = tensor<string, []>("op_237"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_239 = const()[name = tensor<string, []>("op_239"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_61_pad_type_0 = const()[name = tensor<string, []>("input_61_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_61_pad_0 = const()[name = tensor<string, []>("input_61_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [128, 128, 3, 3]> model_model_6_m_0_cv1_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_6_m_0_cv1_conv_weight_to_fp16"), val = tensor<fp16, [128, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1362368)))];
            tensor<fp16, [128]> model_model_6_m_0_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_6_m_0_cv1_conv_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1657344)))];
            tensor<fp16, [1, 128, 40, 40]> input_61_cast_fp16 = conv(bias = model_model_6_m_0_cv1_conv_bias_to_fp16, dilations = var_239, groups = var_20, pad = input_61_pad_0, pad_type = input_61_pad_type_0, strides = var_237, weight = model_model_6_m_0_cv1_conv_weight_to_fp16, x = var_229_cast_fp16_1)[name = tensor<string, []>("input_61_cast_fp16")];
            tensor<fp16, [1, 128, 40, 40]> input_63_cast_fp16 = silu(x = input_61_cast_fp16)[name = tensor<string, []>("input_63_cast_fp16")];
            tensor<int32, [2]> var_246 = const()[name = tensor<string, []>("op_246"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_248 = const()[name = tensor<string, []>("op_248"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_65_pad_type_0 = const()[name = tensor<string, []>("input_65_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_65_pad_0 = const()[name = tensor<string, []>("input_65_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [128, 128, 3, 3]> model_model_6_m_0_cv2_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_6_m_0_cv2_conv_weight_to_fp16"), val = tensor<fp16, [128, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1657664)))];
            tensor<fp16, [128]> model_model_6_m_0_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_6_m_0_cv2_conv_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1952640)))];
            tensor<fp16, [1, 128, 40, 40]> input_65_cast_fp16 = conv(bias = model_model_6_m_0_cv2_conv_bias_to_fp16, dilations = var_248, groups = var_20, pad = input_65_pad_0, pad_type = input_65_pad_type_0, strides = var_246, weight = model_model_6_m_0_cv2_conv_weight_to_fp16, x = input_63_cast_fp16)[name = tensor<string, []>("input_65_cast_fp16")];
            tensor<fp16, [1, 128, 40, 40]> var_251_cast_fp16 = silu(x = input_65_cast_fp16)[name = tensor<string, []>("op_251_cast_fp16")];
            tensor<fp16, [1, 128, 40, 40]> input_67_cast_fp16 = add(x = var_229_cast_fp16_1, y = var_251_cast_fp16)[name = tensor<string, []>("input_67_cast_fp16")];
            tensor<int32, [2]> var_258 = const()[name = tensor<string, []>("op_258"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_260 = const()[name = tensor<string, []>("op_260"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_69_pad_type_0 = const()[name = tensor<string, []>("input_69_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_69_pad_0 = const()[name = tensor<string, []>("input_69_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [128, 128, 3, 3]> model_model_6_m_1_cv1_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_6_m_1_cv1_conv_weight_to_fp16"), val = tensor<fp16, [128, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1952960)))];
            tensor<fp16, [128]> model_model_6_m_1_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_6_m_1_cv1_conv_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2247936)))];
            tensor<fp16, [1, 128, 40, 40]> input_69_cast_fp16 = conv(bias = model_model_6_m_1_cv1_conv_bias_to_fp16, dilations = var_260, groups = var_20, pad = input_69_pad_0, pad_type = input_69_pad_type_0, strides = var_258, weight = model_model_6_m_1_cv1_conv_weight_to_fp16, x = input_67_cast_fp16)[name = tensor<string, []>("input_69_cast_fp16")];
            tensor<fp16, [1, 128, 40, 40]> input_71_cast_fp16 = silu(x = input_69_cast_fp16)[name = tensor<string, []>("input_71_cast_fp16")];
            tensor<int32, [2]> var_267 = const()[name = tensor<string, []>("op_267"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_269 = const()[name = tensor<string, []>("op_269"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_73_pad_type_0 = const()[name = tensor<string, []>("input_73_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_73_pad_0 = const()[name = tensor<string, []>("input_73_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [128, 128, 3, 3]> model_model_6_m_1_cv2_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_6_m_1_cv2_conv_weight_to_fp16"), val = tensor<fp16, [128, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2248256)))];
            tensor<fp16, [128]> model_model_6_m_1_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_6_m_1_cv2_conv_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2543232)))];
            tensor<fp16, [1, 128, 40, 40]> input_73_cast_fp16 = conv(bias = model_model_6_m_1_cv2_conv_bias_to_fp16, dilations = var_269, groups = var_20, pad = input_73_pad_0, pad_type = input_73_pad_type_0, strides = var_267, weight = model_model_6_m_1_cv2_conv_weight_to_fp16, x = input_71_cast_fp16)[name = tensor<string, []>("input_73_cast_fp16")];
            tensor<fp16, [1, 128, 40, 40]> var_272_cast_fp16 = silu(x = input_73_cast_fp16)[name = tensor<string, []>("op_272_cast_fp16")];
            tensor<fp16, [1, 128, 40, 40]> var_273_cast_fp16 = add(x = input_67_cast_fp16, y = var_272_cast_fp16)[name = tensor<string, []>("op_273_cast_fp16")];
            tensor<bool, []> input_75_interleave_0 = const()[name = tensor<string, []>("input_75_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 512, 40, 40]> input_75_cast_fp16 = concat(axis = var_20, interleave = input_75_interleave_0, values = (var_229_cast_fp16_0, var_229_cast_fp16_1, input_67_cast_fp16, var_273_cast_fp16))[name = tensor<string, []>("input_75_cast_fp16")];
            tensor<int32, [2]> var_279 = const()[name = tensor<string, []>("op_279"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_281 = const()[name = tensor<string, []>("op_281"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_77_pad_type_0 = const()[name = tensor<string, []>("input_77_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_77_pad_0 = const()[name = tensor<string, []>("input_77_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [256, 512, 1, 1]> model_model_6_cv2_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_6_cv2_conv_weight_to_fp16"), val = tensor<fp16, [256, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2543552)))];
            tensor<fp16, [256]> model_model_6_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_6_cv2_conv_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2805760)))];
            tensor<fp16, [1, 256, 40, 40]> input_77_cast_fp16 = conv(bias = model_model_6_cv2_conv_bias_to_fp16, dilations = var_281, groups = var_20, pad = input_77_pad_0, pad_type = input_77_pad_type_0, strides = var_279, weight = model_model_6_cv2_conv_weight_to_fp16, x = input_75_cast_fp16)[name = tensor<string, []>("input_77_cast_fp16")];
            tensor<fp16, [1, 256, 40, 40]> input_79_cast_fp16 = silu(x = input_77_cast_fp16)[name = tensor<string, []>("input_79_cast_fp16")];
            tensor<int32, [2]> var_288 = const()[name = tensor<string, []>("op_288"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> var_290 = const()[name = tensor<string, []>("op_290"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_81_pad_type_0 = const()[name = tensor<string, []>("input_81_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_81_pad_0 = const()[name = tensor<string, []>("input_81_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [512, 256, 3, 3]> model_model_7_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_7_conv_weight_to_fp16"), val = tensor<fp16, [512, 256, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2806336)))];
            tensor<fp16, [512]> model_model_7_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_7_conv_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5165696)))];
            tensor<fp16, [1, 512, 20, 20]> input_81_cast_fp16 = conv(bias = model_model_7_conv_bias_to_fp16, dilations = var_290, groups = var_20, pad = input_81_pad_0, pad_type = input_81_pad_type_0, strides = var_288, weight = model_model_7_conv_weight_to_fp16, x = input_79_cast_fp16)[name = tensor<string, []>("input_81_cast_fp16")];
            tensor<fp16, [1, 512, 20, 20]> input_83_cast_fp16 = silu(x = input_81_cast_fp16)[name = tensor<string, []>("input_83_cast_fp16")];
            tensor<int32, [2]> var_301 = const()[name = tensor<string, []>("op_301"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_303 = const()[name = tensor<string, []>("op_303"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_85_pad_type_0 = const()[name = tensor<string, []>("input_85_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_85_pad_0 = const()[name = tensor<string, []>("input_85_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [512, 512, 1, 1]> model_model_8_cv1_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_8_cv1_conv_weight_to_fp16"), val = tensor<fp16, [512, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5166784)))];
            tensor<fp16, [512]> model_model_8_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_8_cv1_conv_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5691136)))];
            tensor<fp16, [1, 512, 20, 20]> input_85_cast_fp16 = conv(bias = model_model_8_cv1_conv_bias_to_fp16, dilations = var_303, groups = var_20, pad = input_85_pad_0, pad_type = input_85_pad_type_0, strides = var_301, weight = model_model_8_cv1_conv_weight_to_fp16, x = input_83_cast_fp16)[name = tensor<string, []>("input_85_cast_fp16")];
            tensor<fp16, [1, 512, 20, 20]> var_306_cast_fp16 = silu(x = input_85_cast_fp16)[name = tensor<string, []>("op_306_cast_fp16")];
            tensor<int32, [2]> var_307 = const()[name = tensor<string, []>("op_307"), val = tensor<int32, [2]>([256, 256])];
            tensor<int32, []> var_308_axis_0 = const()[name = tensor<string, []>("op_308_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 256, 20, 20]> var_308_cast_fp16_0, tensor<fp16, [1, 256, 20, 20]> var_308_cast_fp16_1 = split(axis = var_308_axis_0, split_sizes = var_307, x = var_306_cast_fp16)[name = tensor<string, []>("op_308_cast_fp16")];
            tensor<int32, [2]> var_316 = const()[name = tensor<string, []>("op_316"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_318 = const()[name = tensor<string, []>("op_318"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_89_pad_type_0 = const()[name = tensor<string, []>("input_89_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_89_pad_0 = const()[name = tensor<string, []>("input_89_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [256, 256, 3, 3]> model_model_8_m_0_cv1_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_8_m_0_cv1_conv_weight_to_fp16"), val = tensor<fp16, [256, 256, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5692224)))];
            tensor<fp16, [256]> model_model_8_m_0_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_8_m_0_cv1_conv_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6871936)))];
            tensor<fp16, [1, 256, 20, 20]> input_89_cast_fp16 = conv(bias = model_model_8_m_0_cv1_conv_bias_to_fp16, dilations = var_318, groups = var_20, pad = input_89_pad_0, pad_type = input_89_pad_type_0, strides = var_316, weight = model_model_8_m_0_cv1_conv_weight_to_fp16, x = var_308_cast_fp16_1)[name = tensor<string, []>("input_89_cast_fp16")];
            tensor<fp16, [1, 256, 20, 20]> input_91_cast_fp16 = silu(x = input_89_cast_fp16)[name = tensor<string, []>("input_91_cast_fp16")];
            tensor<int32, [2]> var_325 = const()[name = tensor<string, []>("op_325"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_327 = const()[name = tensor<string, []>("op_327"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_93_pad_type_0 = const()[name = tensor<string, []>("input_93_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_93_pad_0 = const()[name = tensor<string, []>("input_93_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [256, 256, 3, 3]> model_model_8_m_0_cv2_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_8_m_0_cv2_conv_weight_to_fp16"), val = tensor<fp16, [256, 256, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6872512)))];
            tensor<fp16, [256]> model_model_8_m_0_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_8_m_0_cv2_conv_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8052224)))];
            tensor<fp16, [1, 256, 20, 20]> input_93_cast_fp16 = conv(bias = model_model_8_m_0_cv2_conv_bias_to_fp16, dilations = var_327, groups = var_20, pad = input_93_pad_0, pad_type = input_93_pad_type_0, strides = var_325, weight = model_model_8_m_0_cv2_conv_weight_to_fp16, x = input_91_cast_fp16)[name = tensor<string, []>("input_93_cast_fp16")];
            tensor<fp16, [1, 256, 20, 20]> var_330_cast_fp16 = silu(x = input_93_cast_fp16)[name = tensor<string, []>("op_330_cast_fp16")];
            tensor<fp16, [1, 256, 20, 20]> var_331_cast_fp16 = add(x = var_308_cast_fp16_1, y = var_330_cast_fp16)[name = tensor<string, []>("op_331_cast_fp16")];
            tensor<bool, []> input_95_interleave_0 = const()[name = tensor<string, []>("input_95_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 768, 20, 20]> input_95_cast_fp16 = concat(axis = var_20, interleave = input_95_interleave_0, values = (var_308_cast_fp16_0, var_308_cast_fp16_1, var_331_cast_fp16))[name = tensor<string, []>("input_95_cast_fp16")];
            tensor<int32, [2]> var_337 = const()[name = tensor<string, []>("op_337"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_339 = const()[name = tensor<string, []>("op_339"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_97_pad_type_0 = const()[name = tensor<string, []>("input_97_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_97_pad_0 = const()[name = tensor<string, []>("input_97_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [512, 768, 1, 1]> model_model_8_cv2_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_8_cv2_conv_weight_to_fp16"), val = tensor<fp16, [512, 768, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8052800)))];
            tensor<fp16, [512]> model_model_8_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_8_cv2_conv_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8839296)))];
            tensor<fp16, [1, 512, 20, 20]> input_97_cast_fp16 = conv(bias = model_model_8_cv2_conv_bias_to_fp16, dilations = var_339, groups = var_20, pad = input_97_pad_0, pad_type = input_97_pad_type_0, strides = var_337, weight = model_model_8_cv2_conv_weight_to_fp16, x = input_95_cast_fp16)[name = tensor<string, []>("input_97_cast_fp16")];
            tensor<fp16, [1, 512, 20, 20]> input_99_cast_fp16 = silu(x = input_97_cast_fp16)[name = tensor<string, []>("input_99_cast_fp16")];
            tensor<int32, [2]> var_348 = const()[name = tensor<string, []>("op_348"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_350 = const()[name = tensor<string, []>("op_350"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_101_pad_type_0 = const()[name = tensor<string, []>("input_101_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_101_pad_0 = const()[name = tensor<string, []>("input_101_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [256, 512, 1, 1]> model_model_9_cv1_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_model_9_cv1_conv_weight_to_fp16"), val = tensor<fp16, [256, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8840384)))];
            tensor<fp16, [256]> model_model_9_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_model_9_cv1_conv_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9102592)))];
            tensor<fp16, [1, 256, 20, 20]> input_101_cast_fp16 = conv(bias = model_model_9_cv1_conv_bias_to_fp16, dilations = var_350, groups = var_20, pad = input_101_pad_0, pad_type = input_101_pad_type_0, strides = var_348, weight = model_model_9_cv1_conv_weight_to_fp16, x = input_99_cast_fp16)[name = tensor<string, []>("input_101_cast_fp16")];
            tensor<fp16, [1, 256, 20, 20]> input_103_cast_fp16 = silu(x = input_101_cast_fp16)[name = tensor<string, []>("input_103_cast_fp16")];
            tensor<int32, [2]> var_354 = const()[name = tensor<string, []>("op_354"), val = tensor<int32, [2]>([5, 5])];
            tensor<int32, [2]> var_355 = const()[name = tensor<string, []>("op_355"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_105_pad_type_0 = const()[name = tensor<string, []>("input_105_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_105_pad_0 = const()[name = tensor<string, []>("input_105_pad_0"), val = tensor<int32, [4]>([2, 2, 2, 2])];
            tensor<bool, []> input_105_ceil_mode_0 = const()[name = tensor<string, []>("input_105_ceil_mode_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 256, 20, 20]> input_105_cast_fp16 = max_pool(ceil_mode = input_105_ceil_mode_0, kernel_sizes = var_354, pad = input_105_pad_0, pad_type = input_105_pad_type_0, strides = var_355, x = input_103_cast_fp16)[name = tensor<string, []>("input_105_cast_fp16")];
            tensor<int32, [2]> var_359 = const()[name = tensor<string, []>("op_359"), val = tensor<int32, [2]>([5, 5])];
            tensor<int32, [2]> var_360 = const()[name = tensor<string, []>("op_360"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_107_pad_type_0 = const()[name = tensor<string, []>("input_107_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_107_pad_0 = const()[name = tensor<string, []>("input_107_pad_0"), val = tensor<int32, [4]>([2, 2, 2, 2])];
            tensor<bool, []> input_107_ceil_mode_0 = const()[name = tensor<string, []>("input_107_ceil_mode_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 256, 20, 20]> input_107_cast_fp16 = max_pool(ceil_mode = input_107_ceil_mode_0, kernel_sizes = var_359, pad = input_107_pad_0, pad_type = input_107_pad_type_0, strides = var_360, x = input_105_cast_fp16)[name = tensor<string, []>("input_107_cast_fp16")];
            tensor<int32, [2]> var_364 = const()[name = tensor<string, []>("op_364"), val = tensor<int32, [2]>([5, 5])];
            tensor<int32, [2]> var_365 = const()[name = tensor<string, []>("op_365"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> var_368_pad_type_0 = const()[name = tensor<string, []>("op_368_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> var_368_pad_0 = const()[name = tensor<string, []>("op_368_pad_0"), val = tensor<int32, [4]>([2, 2, 2, 2])];
